ryanhaus/rowan-baja-daq/can-module/software/vendor/mplab/gpio_base/src/packs/PIC32CM1216JH01048_DFP/component/ac.h
/*
 * Component description for AC
 *
 * Copyright (c) 2025 Microchip Technology Inc. and its subsidiaries.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/*  file generated from device description file (ATDF) version 2025-02-18T10:55:45Z  */
#ifndef _PIC32CMJH01_AC_COMPONENT_H_
#define _PIC32CMJH01_AC_COMPONENT_H_

#include "core_cm0plus.h"

/* ************************************************************************** */
/*                       SOFTWARE API DEFINITION FOR AC                       */
/* ************************************************************************** */

/* -------- AC_CTRLA : (AC Offset: 0x00) (R/W 8) Control A -------- */
#define AC_CTRLA_RESETVALUE                   _UINT8_(0x00)                                        /*  (AC_CTRLA) Control A  Reset Value */

#define AC_CTRLA_SWRST_Pos                    _UINT8_(0)                                           /* (AC_CTRLA) Software Reset Position */
#define AC_CTRLA_SWRST_Msk                    (_UINT8_(0x1) << AC_CTRLA_SWRST_Pos)                 /* (AC_CTRLA) Software Reset Mask */
#define AC_CTRLA_SWRST(value)                 (AC_CTRLA_SWRST_Msk & (_UINT8_(value) << AC_CTRLA_SWRST_Pos)) /* Assignment of value for SWRST in the AC_CTRLA register */
#define AC_CTRLA_ENABLE_Pos                   _UINT8_(1)                                           /* (AC_CTRLA) Enable Position */
#define AC_CTRLA_ENABLE_Msk                   (_UINT8_(0x1) << AC_CTRLA_ENABLE_Pos)                /* (AC_CTRLA) Enable Mask */
#define AC_CTRLA_ENABLE(value)                (AC_CTRLA_ENABLE_Msk & (_UINT8_(value) << AC_CTRLA_ENABLE_Pos)) /* Assignment of value for ENABLE in the AC_CTRLA register */
#define AC_CTRLA_Msk                          _UINT8_(0x03)                                        /* (AC_CTRLA) Register Mask  */


/* -------- AC_CTRLB : (AC Offset: 0x01) (R/W 8) Control B -------- */
#define AC_CTRLB_RESETVALUE                   _UINT8_(0x00)                                        /*  (AC_CTRLB) Control B  Reset Value */

#define AC_CTRLB_START0_Pos                   _UINT8_(0)                                           /* (AC_CTRLB) Comparator 0 Start Comparison Position */
#define AC_CTRLB_START0_Msk                   (_UINT8_(0x1) << AC_CTRLB_START0_Pos)                /* (AC_CTRLB) Comparator 0 Start Comparison Mask */
#define AC_CTRLB_START0(value)                (AC_CTRLB_START0_Msk & (_UINT8_(value) << AC_CTRLB_START0_Pos)) /* Assignment of value for START0 in the AC_CTRLB register */
#define AC_CTRLB_START1_Pos                   _UINT8_(1)                                           /* (AC_CTRLB) Comparator 1 Start Comparison Position */
#define AC_CTRLB_START1_Msk                   (_UINT8_(0x1) << AC_CTRLB_START1_Pos)                /* (AC_CTRLB) Comparator 1 Start Comparison Mask */
#define AC_CTRLB_START1(value)                (AC_CTRLB_START1_Msk & (_UINT8_(value) << AC_CTRLB_START1_Pos)) /* Assignment of value for START1 in the AC_CTRLB register */
#define AC_CTRLB_START2_Pos                   _UINT8_(2)                                           /* (AC_CTRLB) Comparator 2 Start Comparison Position */
#define AC_CTRLB_START2_Msk                   (_UINT8_(0x1) << AC_CTRLB_START2_Pos)                /* (AC_CTRLB) Comparator 2 Start Comparison Mask */
#define AC_CTRLB_START2(value)                (AC_CTRLB_START2_Msk & (_UINT8_(value) << AC_CTRLB_START2_Pos)) /* Assignment of value for START2 in the AC_CTRLB register */
#define AC_CTRLB_START3_Pos                   _UINT8_(3)                                           /* (AC_CTRLB) Comparator 3 Start Comparison Position */
#define AC_CTRLB_START3_Msk                   (_UINT8_(0x1) << AC_CTRLB_START3_Pos)                /* (AC_CTRLB) Comparator 3 Start Comparison Mask */
#define AC_CTRLB_START3(value)                (AC_CTRLB_START3_Msk & (_UINT8_(value) << AC_CTRLB_START3_Pos)) /* Assignment of value for START3 in the AC_CTRLB register */
#define AC_CTRLB_Msk                          _UINT8_(0x0F)                                        /* (AC_CTRLB) Register Mask  */

#define AC_CTRLB_START_Pos                    _UINT8_(0)                                           /* (AC_CTRLB Position) Comparator 3 Start Comparison */
#define AC_CTRLB_START_Msk                    (_UINT8_(0xF) << AC_CTRLB_START_Pos)                 /* (AC_CTRLB Mask) START */
#define AC_CTRLB_START(value)                 (AC_CTRLB_START_Msk & (_UINT8_(value) << AC_CTRLB_START_Pos)) 

/* -------- AC_EVCTRL : (AC Offset: 0x02) (R/W 16) Event Control -------- */
#define AC_EVCTRL_RESETVALUE                  _UINT16_(0x00)                                       /*  (AC_EVCTRL) Event Control  Reset Value */

#define AC_EVCTRL_COMPEO0_Pos                 _UINT16_(0)                                          /* (AC_EVCTRL) Comparator 0 Event Output Enable Position */
#define AC_EVCTRL_COMPEO0_Msk                 (_UINT16_(0x1) << AC_EVCTRL_COMPEO0_Pos)             /* (AC_EVCTRL) Comparator 0 Event Output Enable Mask */
#define AC_EVCTRL_COMPEO0(value)              (AC_EVCTRL_COMPEO0_Msk & (_UINT16_(value) << AC_EVCTRL_COMPEO0_Pos)) /* Assignment of value for COMPEO0 in the AC_EVCTRL register */
#define AC_EVCTRL_COMPEO1_Pos                 _UINT16_(1)                                          /* (AC_EVCTRL) Comparator 1 Event Output Enable Position */
#define AC_EVCTRL_COMPEO1_Msk                 (_UINT16_(0x1) << AC_EVCTRL_COMPEO1_Pos)             /* (AC_EVCTRL) Comparator 1 Event Output Enable Mask */
#define AC_EVCTRL_COMPEO1(value)              (AC_EVCTRL_COMPEO1_Msk & (_UINT16_(value) << AC_EVCTRL_COMPEO1_Pos)) /* Assignment of value for COMPEO1 in the AC_EVCTRL register */
#define AC_EVCTRL_COMPEO2_Pos                 _UINT16_(2)                                          /* (AC_EVCTRL) Comparator 2 Event Output Enable Position */
#define AC_EVCTRL_COMPEO2_Msk                 (_UINT16_(0x1) << AC_EVCTRL_COMPEO2_Pos)             /* (AC_EVCTRL) Comparator 2 Event Output Enable Mask */
#define AC_EVCTRL_COMPEO2(value)              (AC_EVCTRL_COMPEO2_Msk & (_UINT16_(value) << AC_EVCTRL_COMPEO2_Pos)) /* Assignment of value for COMPEO2 in the AC_EVCTRL register */
#define AC_EVCTRL_COMPEO3_Pos                 _UINT16_(3)                                          /* (AC_EVCTRL) Comparator 3 Event Output Enable Position */
#define AC_EVCTRL_COMPEO3_Msk                 (_UINT16_(0x1) << AC_EVCTRL_COMPEO3_Pos)             /* (AC_EVCTRL) Comparator 3 Event Output Enable Mask */
#define AC_EVCTRL_COMPEO3(value)              (AC_EVCTRL_COMPEO3_Msk & (_UINT16_(value) << AC_EVCTRL_COMPEO3_Pos)) /* Assignment of value for COMPEO3 in the AC_EVCTRL register */
#define AC_EVCTRL_WINEO0_Pos                  _UINT16_(4)                                          /* (AC_EVCTRL) Window 0 Event Output Enable Position */
#define AC_EVCTRL_WINEO0_Msk                  (_UINT16_(0x1) << AC_EVCTRL_WINEO0_Pos)              /* (AC_EVCTRL) Window 0 Event Output Enable Mask */
#define AC_EVCTRL_WINEO0(value)               (AC_EVCTRL_WINEO0_Msk & (_UINT16_(value) << AC_EVCTRL_WINEO0_Pos)) /* Assignment of value for WINEO0 in the AC_EVCTRL register */
#define AC_EVCTRL_WINEO1_Pos                  _UINT16_(5)                                          /* (AC_EVCTRL) Window 1 Event Output Enable Position */
#define AC_EVCTRL_WINEO1_Msk                  (_UINT16_(0x1) << AC_EVCTRL_WINEO1_Pos)              /* (AC_EVCTRL) Window 1 Event Output Enable Mask */
#define AC_EVCTRL_WINEO1(value)               (AC_EVCTRL_WINEO1_Msk & (_UINT16_(value) << AC_EVCTRL_WINEO1_Pos)) /* Assignment of value for WINEO1 in the AC_EVCTRL register */
#define AC_EVCTRL_COMPEI0_Pos                 _UINT16_(8)                                          /* (AC_EVCTRL) Comparator 0 Event Input Enable Position */
#define AC_EVCTRL_COMPEI0_Msk                 (_UINT16_(0x1) << AC_EVCTRL_COMPEI0_Pos)             /* (AC_EVCTRL) Comparator 0 Event Input Enable Mask */
#define AC_EVCTRL_COMPEI0(value)              (AC_EVCTRL_COMPEI0_Msk & (_UINT16_(value) << AC_EVCTRL_COMPEI0_Pos)) /* Assignment of value for COMPEI0 in the AC_EVCTRL register */
#define AC_EVCTRL_COMPEI1_Pos                 _UINT16_(9)                                          /* (AC_EVCTRL) Comparator 1 Event Input Enable Position */
#define AC_EVCTRL_COMPEI1_Msk                 (_UINT16_(0x1) << AC_EVCTRL_COMPEI1_Pos)             /* (AC_EVCTRL) Comparator 1 Event Input Enable Mask */
#define AC_EVCTRL_COMPEI1(value)              (AC_EVCTRL_COMPEI1_Msk & (_UINT16_(value) << AC_EVCTRL_COMPEI1_Pos)) /* Assignment of value for COMPEI1 in the AC_EVCTRL register */
#define AC_EVCTRL_COMPEI2_Pos                 _UINT16_(10)                                         /* (AC_EVCTRL) Comparator 2 Event Input Enable Position */
#define AC_EVCTRL_COMPEI2_Msk                 (_UINT16_(0x1) << AC_EVCTRL_COMPEI2_Pos)             /* (AC_EVCTRL) Comparator 2 Event Input Enable Mask */
#define AC_EVCTRL_COMPEI2(value)              (AC_EVCTRL_COMPEI2_Msk & (_UINT16_(value) << AC_EVCTRL_COMPEI2_Pos)) /* Assignment of value for COMPEI2 in the AC_EVCTRL register */
#define AC_EVCTRL_COMPEI3_Pos                 _UINT16_(11)                                         /* (AC_EVCTRL) Comparator 3 Event Input Enable Position */
#define AC_EVCTRL_COMPEI3_Msk                 (_UINT16_(0x1) << AC_EVCTRL_COMPEI3_Pos)             /* (AC_EVCTRL) Comparator 3 Event Input Enable Mask */
#define AC_EVCTRL_COMPEI3(value)              (AC_EVCTRL_COMPEI3_Msk & (_UINT16_(value) << AC_EVCTRL_COMPEI3_Pos)) /* Assignment of value for COMPEI3 in the AC_EVCTRL register */
#define AC_EVCTRL_INVEI0_Pos                  _UINT16_(12)                                         /* (AC_EVCTRL) Comparator 0 Input Event Invert Enable Position */
#define AC_EVCTRL_INVEI0_Msk                  (_UINT16_(0x1) << AC_EVCTRL_INVEI0_Pos)              /* (AC_EVCTRL) Comparator 0 Input Event Invert Enable Mask */
#define AC_EVCTRL_INVEI0(value)               (AC_EVCTRL_INVEI0_Msk & (_UINT16_(value) << AC_EVCTRL_INVEI0_Pos)) /* Assignment of value for INVEI0 in the AC_EVCTRL register */
#define AC_EVCTRL_INVEI1_Pos                  _UINT16_(13)                                         /* (AC_EVCTRL) Comparator 1 Input Event Invert Enable Position */
#define AC_EVCTRL_INVEI1_Msk                  (_UINT16_(0x1) << AC_EVCTRL_INVEI1_Pos)              /* (AC_EVCTRL) Comparator 1 Input Event Invert Enable Mask */
#define AC_EVCTRL_INVEI1(value)               (AC_EVCTRL_INVEI1_Msk & (_UINT16_(value) << AC_EVCTRL_INVEI1_Pos)) /* Assignment of value for INVEI1 in the AC_EVCTRL register */
#define AC_EVCTRL_INVEI2_Pos                  _UINT16_(14)                                         /* (AC_EVCTRL) Comparator 2 Input Event Invert Enable Position */
#define AC_EVCTRL_INVEI2_Msk                  (_UINT16_(0x1) << AC_EVCTRL_INVEI2_Pos)              /* (AC_EVCTRL) Comparator 2 Input Event Invert Enable Mask */
#define AC_EVCTRL_INVEI2(value)               (AC_EVCTRL_INVEI2_Msk & (_UINT16_(value) << AC_EVCTRL_INVEI2_Pos)) /* Assignment of value for INVEI2 in the AC_EVCTRL register */
#define AC_EVCTRL_INVEI3_Pos                  _UINT16_(15)                                         /* (AC_EVCTRL) Comparator 3 Input Event Invert Enable Position */
#define AC_EVCTRL_INVEI3_Msk                  (_UINT16_(0x1) << AC_EVCTRL_INVEI3_Pos)              /* (AC_EVCTRL) Comparator 3 Input Event Invert Enable Mask */
#define AC_EVCTRL_INVEI3(value)               (AC_EVCTRL_INVEI3_Msk & (_UINT16_(value) << AC_EVCTRL_INVEI3_Pos)) /* Assignment of value for INVEI3 in the AC_EVCTRL register */
#define AC_EVCTRL_Msk                         _UINT16_(0xFF3F)                                     /* (AC_EVCTRL) Register Mask  */

#define AC_EVCTRL_COMPEO_Pos                  _UINT16_(0)                                          /* (AC_EVCTRL Position) Comparator x Event Output Enable */
#define AC_EVCTRL_COMPEO_Msk                  (_UINT16_(0xF) << AC_EVCTRL_COMPEO_Pos)              /* (AC_EVCTRL Mask) COMPEO */
#define AC_EVCTRL_COMPEO(value)               (AC_EVCTRL_COMPEO_Msk & (_UINT16_(value) << AC_EVCTRL_COMPEO_Pos)) 
#define AC_EVCTRL_WINEO_Pos                   _UINT16_(4)                                          /* (AC_EVCTRL Position) Window x Event Output Enable */
#define AC_EVCTRL_WINEO_Msk                   (_UINT16_(0x3) << AC_EVCTRL_WINEO_Pos)               /* (AC_EVCTRL Mask) WINEO */
#define AC_EVCTRL_WINEO(value)                (AC_EVCTRL_WINEO_Msk & (_UINT16_(value) << AC_EVCTRL_WINEO_Pos)) 
#define AC_EVCTRL_COMPEI_Pos                  _UINT16_(8)                                          /* (AC_EVCTRL Position) Comparator x Event Input Enable */
#define AC_EVCTRL_COMPEI_Msk                  (_UINT16_(0xF) << AC_EVCTRL_COMPEI_Pos)              /* (AC_EVCTRL Mask) COMPEI */
#define AC_EVCTRL_COMPEI(value)               (AC_EVCTRL_COMPEI_Msk & (_UINT16_(value) << AC_EVCTRL_COMPEI_Pos)) 
#define AC_EVCTRL_INVEI_Pos                   _UINT16_(12)                                         /* (AC_EVCTRL Position) Comparator 3 Input Event Invert Enable */
#define AC_EVCTRL_INVEI_Msk                   (_UINT16_(0xF) << AC_EVCTRL_INVEI_Pos)               /* (AC_EVCTRL Mask) INVEI */
#define AC_EVCTRL_INVEI(value)                (AC_EVCTRL_INVEI_Msk & (_UINT16_(value) << AC_EVCTRL_INVEI_Pos)) 

/* -------- AC_INTENCLR : (AC Offset: 0x04) (R/W 8) Interrupt Enable Clear -------- */
#define AC_INTENCLR_RESETVALUE                _UINT8_(0x00)                                        /*  (AC_INTENCLR) Interrupt Enable Clear  Reset Value */

#define AC_INTENCLR_COMP0_Pos                 _UINT8_(0)                                           /* (AC_INTENCLR) Comparator 0 Interrupt Enable Position */
#define AC_INTENCLR_COMP0_Msk                 (_UINT8_(0x1) << AC_INTENCLR_COMP0_Pos)              /* (AC_INTENCLR) Comparator 0 Interrupt Enable Mask */
#define AC_INTENCLR_COMP0(value)              (AC_INTENCLR_COMP0_Msk & (_UINT8_(value) << AC_INTENCLR_COMP0_Pos)) /* Assignment of value for COMP0 in the AC_INTENCLR register */
#define AC_INTENCLR_COMP1_Pos                 _UINT8_(1)                                           /* (AC_INTENCLR) Comparator 1 Interrupt Enable Position */
#define AC_INTENCLR_COMP1_Msk                 (_UINT8_(0x1) << AC_INTENCLR_COMP1_Pos)              /* (AC_INTENCLR) Comparator 1 Interrupt Enable Mask */
#define AC_INTENCLR_COMP1(value)              (AC_INTENCLR_COMP1_Msk & (_UINT8_(value) << AC_INTENCLR_COMP1_Pos)) /* Assignment of value for COMP1 in the AC_INTENCLR register */
#define AC_INTENCLR_COMP2_Pos                 _UINT8_(2)                                           /* (AC_INTENCLR) Comparator 2 Interrupt Enable Position */
#define AC_INTENCLR_COMP2_Msk                 (_UINT8_(0x1) << AC_INTENCLR_COMP2_Pos)              /* (AC_INTENCLR) Comparator 2 Interrupt Enable Mask */
#define AC_INTENCLR_COMP2(value)              (AC_INTENCLR_COMP2_Msk & (_UINT8_(value) << AC_INTENCLR_COMP2_Pos)) /* Assignment of value for COMP2 in the AC_INTENCLR register */
#define AC_INTENCLR_COMP3_Pos                 _UINT8_(3)                                           /* (AC_INTENCLR) Comparator 3 Interrupt Enable Position */
#define AC_INTENCLR_COMP3_Msk                 (_UINT8_(0x1) << AC_INTENCLR_COMP3_Pos)              /* (AC_INTENCLR) Comparator 3 Interrupt Enable Mask */
#define AC_INTENCLR_COMP3(value)              (AC_INTENCLR_COMP3_Msk & (_UINT8_(value) << AC_INTENCLR_COMP3_Pos)) /* Assignment of value for COMP3 in the AC_INTENCLR register */
#define AC_INTENCLR_WIN0_Pos                  _UINT8_(4)                                           /* (AC_INTENCLR) Window 0 Interrupt Enable Position */
#define AC_INTENCLR_WIN0_Msk                  (_UINT8_(0x1) << AC_INTENCLR_WIN0_Pos)               /* (AC_INTENCLR) Window 0 Interrupt Enable Mask */
#define AC_INTENCLR_WIN0(value)               (AC_INTENCLR_WIN0_Msk & (_UINT8_(value) << AC_INTENCLR_WIN0_Pos)) /* Assignment of value for WIN0 in the AC_INTENCLR register */
#define AC_INTENCLR_WIN1_Pos                  _UINT8_(5)                                           /* (AC_INTENCLR) Window 1 Interrupt Enable Position */
#define AC_INTENCLR_WIN1_Msk                  (_UINT8_(0x1) << AC_INTENCLR_WIN1_Pos)               /* (AC_INTENCLR) Window 1 Interrupt Enable Mask */
#define AC_INTENCLR_WIN1(value)               (AC_INTENCLR_WIN1_Msk & (_UINT8_(value) << AC_INTENCLR_WIN1_Pos)) /* Assignment of value for WIN1 in the AC_INTENCLR register */
#define AC_INTENCLR_Msk                       _UINT8_(0x3F)                                        /* (AC_INTENCLR) Register Mask  */

#define AC_INTENCLR_COMP_Pos                  _UINT8_(0)                                           /* (AC_INTENCLR Position) Comparator x Interrupt Enable */
#define AC_INTENCLR_COMP_Msk                  (_UINT8_(0xF) << AC_INTENCLR_COMP_Pos)               /* (AC_INTENCLR Mask) COMP */
#define AC_INTENCLR_COMP(value)               (AC_INTENCLR_COMP_Msk & (_UINT8_(value) << AC_INTENCLR_COMP_Pos)) 
#define AC_INTENCLR_WIN_Pos                   _UINT8_(4)                                           /* (AC_INTENCLR Position) Window x Interrupt Enable */
#define AC_INTENCLR_WIN_Msk                   (_UINT8_(0x3) << AC_INTENCLR_WIN_Pos)                /* (AC_INTENCLR Mask) WIN */
#define AC_INTENCLR_WIN(value)                (AC_INTENCLR_WIN_Msk & (_UINT8_(value) << AC_INTENCLR_WIN_Pos)) 

/* -------- AC_INTENSET : (AC Offset: 0x05) (R/W 8) Interrupt Enable Set -------- */
#define AC_INTENSET_RESETVALUE                _UINT8_(0x00)                                        /*  (AC_INTENSET) Interrupt Enable Set  Reset Value */

#define AC_INTENSET_COMP0_Pos                 _UINT8_(0)                                           /* (AC_INTENSET) Comparator 0 Interrupt Enable Position */
#define AC_INTENSET_COMP0_Msk                 (_UINT8_(0x1) << AC_INTENSET_COMP0_Pos)              /* (AC_INTENSET) Comparator 0 Interrupt Enable Mask */
#define AC_INTENSET_COMP0(value)              (AC_INTENSET_COMP0_Msk & (_UINT8_(value) << AC_INTENSET_COMP0_Pos)) /* Assignment of value for COMP0 in the AC_INTENSET register */
#define AC_INTENSET_COMP1_Pos                 _UINT8_(1)                                           /* (AC_INTENSET) Comparator 1 Interrupt Enable Position */
#define AC_INTENSET_COMP1_Msk                 (_UINT8_(0x1) << AC_INTENSET_COMP1_Pos)              /* (AC_INTENSET) Comparator 1 Interrupt Enable Mask */
#define AC_INTENSET_COMP1(value)              (AC_INTENSET_COMP1_Msk & (_UINT8_(value) << AC_INTENSET_COMP1_Pos)) /* Assignment of value for COMP1 in the AC_INTENSET register */
#define AC_INTENSET_COMP2_Pos                 _UINT8_(2)                                           /* (AC_INTENSET) Comparator 2 Interrupt Enable Position */
#define AC_INTENSET_COMP2_Msk                 (_UINT8_(0x1) << AC_INTENSET_COMP2_Pos)              /* (AC_INTENSET) Comparator 2 Interrupt Enable Mask */
#define AC_INTENSET_COMP2(value)              (AC_INTENSET_COMP2_Msk & (_UINT8_(value) << AC_INTENSET_COMP2_Pos)) /* Assignment of value for COMP2 in the AC_INTENSET register */
#define AC_INTENSET_COMP3_Pos                 _UINT8_(3)                                           /* (AC_INTENSET) Comparator 3 Interrupt Enable Position */
#define AC_INTENSET_COMP3_Msk                 (_UINT8_(0x1) << AC_INTENSET_COMP3_Pos)              /* (AC_INTENSET) Comparator 3 Interrupt Enable Mask */
#define AC_INTENSET_COMP3(value)              (AC_INTENSET_COMP3_Msk & (_UINT8_(value) << AC_INTENSET_COMP3_Pos)) /* Assignment of value for COMP3 in the AC_INTENSET register */
#define AC_INTENSET_WIN0_Pos                  _UINT8_(4)                                           /* (AC_INTENSET) Window 0 Interrupt Enable Position */
#define AC_INTENSET_WIN0_Msk                  (_UINT8_(0x1) << AC_INTENSET_WIN0_Pos)               /* (AC_INTENSET) Window 0 Interrupt Enable Mask */
#define AC_INTENSET_WIN0(value)               (AC_INTENSET_WIN0_Msk & (_UINT8_(value) << AC_INTENSET_WIN0_Pos)) /* Assignment of value for WIN0 in the AC_INTENSET register */
#define AC_INTENSET_WIN1_Pos                  _UINT8_(5)                                           /* (AC_INTENSET) Window 1 Interrupt Enable Position */
#define AC_INTENSET_WIN1_Msk                  (_UINT8_(0x1) << AC_INTENSET_WIN1_Pos)               /* (AC_INTENSET) Window 1 Interrupt Enable Mask */
#define AC_INTENSET_WIN1(value)               (AC_INTENSET_WIN1_Msk & (_UINT8_(value) << AC_INTENSET_WIN1_Pos)) /* Assignment of value for WIN1 in the AC_INTENSET register */
#define AC_INTENSET_Msk                       _UINT8_(0x3F)                                        /* (AC_INTENSET) Register Mask  */

#define AC_INTENSET_COMP_Pos                  _UINT8_(0)                                           /* (AC_INTENSET Position) Comparator x Interrupt Enable */
#define AC_INTENSET_COMP_Msk                  (_UINT8_(0xF) << AC_INTENSET_COMP_Pos)               /* (AC_INTENSET Mask) COMP */
#define AC_INTENSET_COMP(value)               (AC_INTENSET_COMP_Msk & (_UINT8_(value) << AC_INTENSET_COMP_Pos)) 
#define AC_INTENSET_WIN_Pos                   _UINT8_(4)                                           /* (AC_INTENSET Position) Window x Interrupt Enable */
#define AC_INTENSET_WIN_Msk                   (_UINT8_(0x3) << AC_INTENSET_WIN_Pos)                /* (AC_INTENSET Mask) WIN */
#define AC_INTENSET_WIN(value)                (AC_INTENSET_WIN_Msk & (_UINT8_(value) << AC_INTENSET_WIN_Pos)) 

/* -------- AC_INTFLAG : (AC Offset: 0x06) (R/W 8) Interrupt Flag Status and Clear -------- */
#define AC_INTFLAG_RESETVALUE                 _UINT8_(0x00)                                        /*  (AC_INTFLAG) Interrupt Flag Status and Clear  Reset Value */

